app/controllers/places_controller.rb

INSERT INTO "places" ("title", "description", "price", "category", "image", "address", "zip_code", "city", "borough", "url", "created_at", "updated_at", "is_validate") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @place = Place.new(place_params)

    if @place.save

UPDATE "places" SET "updated_at" = $1, "is_validate" = $2 WHERE "places"."id" = $3  [["updated_at", "2023-09-18 14:09:26.676512"], ["is_validate", true], ["id", 13]]
---
  def update
    if @place.update(place_params)

DELETE FROM "places" WHERE "places"."id" = $1  [["id", 1]]
---
  def destroy
    @place.destroy

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_place
      @place = Place.find(params[:id])