app/controllers/testimonies_controller.rb

  def index
    @testimonies = Testimony.all
---
SELECT "testimonies".* FROM "testimonies"

  def create
    @testimony = Testimony.new(testimony_params)

    if @testimony.save
---
INSERT INTO "testimonies" ("description", "created_at", "updated_at", "is_validate", "age", "first_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @testimony.update(testimony_params)
---
UPDATE "testimonies" SET "updated_at" = $1, "is_validate" = $2 WHERE "testimonies"."id" = $3  [["updated_at", "2023-09-20 15:56:47.741533"], ["is_validate", true], ["id", 2]]

  def destroy
    @testimony.destroy
---
DELETE FROM "testimonies" WHERE "testimonies"."id" = $1  [["id", 2]]

    def set_testimony
      @testimony = Testimony.find(params[:id])
---
SELECT "testimonies".* FROM "testimonies" WHERE "testimonies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]